import imgUrl from "../assets/image.png";

const Home = () => {
  return (
    <div
      className="bg-cover bg-center bg-no-repeat h-screen rounded-2xl "
      style={{ backgroundImage: `url(${imgUrl})` }}
    >
      <div className="bg-gradient-to-r from-black/80 to-black/50 h-full p-4 rounded-2xl">
        <h2 className="text-3xl font-semibold text-red-400 mb-4">
          Слова подяки 😁
        </h2>
        <div className="text-xl text-justify flex flex-col gap-4 text-amber-50">
          <p>Привіт, команда школи GoIt! 🚀</p>

          <p>
            Хочу подякувати вам за крутий курс з React! Це був справді цікавий
            та насичений досвід, який дав мені багато знань і трохи наблизив до
            впевненості у роботі з цією технологією.
          </p>

          <p className="text-3xl">Викладачі — ви просто космос! 🌟</p>
          <p>
            Сергій Дринкін, дякую Вам за те, що змогли пояснити складні речі
            простими словами. Також за купу плюшок, тобто додаткової інформації,
            що мотивує до створення більш якісних робіт. Дякую.
          </p>

          <p>
            Сергій Дикий, дякую Вам за надані відповіді, та Вашу витримку. Коли
            ми з Вами знаходимося на різних рівнях знань, то іноді буває дуже
            важко донести до учня свою думку. Дякую.
          </p>
          <p>
            Олексій Коротенко, дякую за те, що показали, як теорія втілюється у
            проєкти. Без Ваших практичних занять дуже складно було б скласти все
            до купи, та й ще у вірному порядку. І хоча у голові все одно бардак,
            але початок покладено. Дякую.
          </p>

          <p>
            Також дякую команді GoIt за атмосферу — навчання було не лише
            корисним, але й дуже комфортним. Матеріали, приклади та підтримка —
            усе на вищому рівні. Дякую вам велике за те, що допомогли мені
            зробити ще один крок у світі IT. Ви найкращі! 💻✨
          </p>

          <p> Здаємо останню домашку по React та зустрінемося на Node.js</p>

          <p> З найкращими побажаннями, Євген Осадчий!</p>
        </div>
      </div>
    </div>
  );
};

export default Home;
